## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # datadog_dashboard.service_dashboard[0] will be updated in-place
  ~ resource "datadog_dashboard" "service_dashboard" {
        id                      = "4jj-dh7-k8z"
        tags                    = []
        # (9 unchanged attributes hidden)

      ~ template_variable {
-           default          = "production" -> null
          ~ defaults         = [
+               "production",
            ]
            name             = "env"
            # (2 unchanged attributes hidden)
        }
      ~ template_variable {
-           default          = "grants-ingest" -> null
          ~ defaults         = [
+               "grants-ingest",
            ]
            name             = "service"
            # (2 unchanged attributes hidden)
        }
      ~ template_variable {
-           default          = "*" -> null
          ~ defaults         = [
+               "*",
            ]
            name             = "version"
            # (2 unchanged attributes hidden)
        }

      ~ widget {
            id = 7060137772964863

          ~ group_definition {
                # (3 unchanged attributes hidden)

              ~ widget {
                    id = 2833432971673228

                  ~ widget_layout {
                      ~ height          = 9 -> 6
                        # (4 unchanged attributes hidden)
                    }

                    # (1 unchanged block hidden)
                }
-               widget {
-                   id = 3410808562235972 -> null

-                   sunburst_definition {
-                       hide_total  = false -> null
-                       title       = "Grant Updates Published in Period" -> null
-                       title_align = "left" -> null
-                       title_size  = "16" -> null

-                       legend_table {}

-                       request {
-                           formula {
-                               formula_expression = "query1" -> null

-                               limit {
-                                   count = 500 -> null
-                                   order = "desc" -> null
                                }
                            }
-                           query {
-                               metric_query {
-                                   aggregator  = "sum" -> null
-                                   data_source = "metrics" -> null
-                                   name        = "query1" -> null
-                                   query       = "sum:grants_ingest.PublishGrantEvents.event.published{$service, $env}.as_count()" -> null
                                }
                            }
-                           style {
-                               palette = "datadog16" -> null
                            }
                        }
                    }

-                   widget_layout {
-                       height          = 3 -> null
-                       is_column_break = false -> null
-                       width           = 4 -> null
-                       x               = 8 -> null
-                       y               = 6 -> null
                    }
                }

                # (1 unchanged block hidden)
            }

          ~ widget_layout {
              ~ height          = 10 -> 6
                # (4 unchanged attributes hidden)
            }
        }
      ~ widget {
            id = 7370760792383743

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 10 -> 6
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 4221397642482799

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 14 -> 9
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 8477815688600517

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 18 -> 12
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 2104149552975257

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 22 -> 15
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 5046282420920828

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 26 -> 18
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 6907345174500015

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 30 -> 21
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 8614522705467412

          ~ widget_layout {
              ~ height          = 7 -> 6
              ~ y               = 34 -> 24
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 256173609813438

          ~ group_definition {
                # (3 unchanged attributes hidden)

              ~ widget {
                    id = 5838548405759132

                  ~ widget_layout {
                      ~ height          = 16 -> 13
                        # (4 unchanged attributes hidden)
                    }

                    # (1 unchanged block hidden)
                }
              ~ widget {
                    id = 280130678238919

                  ~ widget_layout {
                      ~ height          = 5 -> 4
                        # (4 unchanged attributes hidden)
                    }

                    # (1 unchanged block hidden)
                }

                # (6 unchanged blocks hidden)
            }

          ~ widget_layout {
              ~ height          = 17 -> 13
              ~ y               = 41 -> 30
                # (3 unchanged attributes hidden)
            }
        }
      ~ widget {
            id = 4201928207253110

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 58 -> 43
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 934058936296128

          ~ widget_layout {
              ~ height          = 7 -> 6
              ~ y               = 62 -> 46
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 942130410430918

          ~ widget_layout {
              ~ height          = 4 -> 3
              ~ y               = 69 -> 52
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "259c5d1abd973a6d69e82eaee2139fc5-3" -> (known after apply)
      ~ id                     = "87f676bc66e1cd463c45d66d5ac34c2e.zip" -> (known after apply)
      ~ key                    = "87f676bc66e1cd463c45d66d5ac34c2e.zip" -> "9a8232b7a3c33328fb1ea06c88db542b.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "xeY679jQbIkff5KPjSaXfrHPUZxQUFyC" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2023-11-13T01:45:07.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadFFISSpreadsheet:37" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadFFISSpreadsheet:37/invocations" -> (known after apply)
      ~ s3_key                         = "87f676bc66e1cd463c45d66d5ac34c2e.zip" -> "9a8232b7a3c33328fb1ea06c88db542b.zip"
        tags                           = {}
      ~ version                        = "37" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:f9825667bd5af760860985b869dafe5ba952b6b7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet" -> "git.commit.sha:576550af912f284bf7de34646e61f57d11b1f5fd,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet"
              ~ "DD_VERSION"                   = "f9825667bd5af760860985b869dafe5ba952b6b7" -> "576550af912f284bf7de34646e61f57d11b1f5fd"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "SQSQueueNotification" -> (known after apply)
      ~ qualifier           = "37" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "bfedf2c45be284c9df22977803e17bd9-3" -> (known after apply)
      ~ id                     = "123c409c86da87490d561a776b602b26.zip" -> (known after apply)
      ~ key                    = "123c409c86da87490d561a776b602b26.zip" -> "f7faaaf8d0adfa9937a7794349a31061.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "cl.UDvoII.Tir8dr0D5Jt4U92yzwyCZB" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-11-13T01:45:07.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadGrantsGovDB:37" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadGrantsGovDB:37/invocations" -> (known after apply)
      ~ s3_key                         = "123c409c86da87490d561a776b602b26.zip" -> "f7faaaf8d0adfa9937a7794349a31061.zip"
        tags                           = {}
      ~ version                        = "37" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:f9825667bd5af760860985b869dafe5ba952b6b7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:576550af912f284bf7de34646e61f57d11b1f5fd,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "f9825667bd5af760860985b869dafe5ba952b6b7" -> "576550af912f284bf7de34646e61f57d11b1f5fd"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "37" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "cd2b9514a1472e787ec581dd06780b01-3" -> (known after apply)
      ~ id                     = "ddfc82d52aea92f01d593985ff1c2e08.zip" -> (known after apply)
      ~ key                    = "ddfc82d52aea92f01d593985ff1c2e08.zip" -> "00d5e5305c5e2670ef09d960f4d81480.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "puX3upD75homJW6PUkJml.7fJMpwXIAi" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-EnqueueFFISDownload"
      ~ last_modified                  = "2023-11-13T01:45:07.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-EnqueueFFISDownload:37" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-EnqueueFFISDownload:37/invocations" -> (known after apply)
      ~ s3_key                         = "ddfc82d52aea92f01d593985ff1c2e08.zip" -> "00d5e5305c5e2670ef09d960f4d81480.zip"
        tags                           = {}
      ~ version                        = "37" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:f9825667bd5af760860985b869dafe5ba952b6b7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:576550af912f284bf7de34646e61f57d11b1f5fd,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "f9825667bd5af760860985b869dafe5ba952b6b7" -> "576550af912f284bf7de34646e61f57d11b1f5fd"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "37" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "f164209f3ee41744c49b5f6435064f82-3" -> (known after apply)
      ~ id                     = "22727beabcc276c85ec71cfb71993bb6.zip" -> (known after apply)
      ~ key                    = "22727beabcc276c85ec71cfb71993bb6.zip" -> "af95b7d97693f06819e40ab1fae30546.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "5Uls3O3f7Q6v.T4WONDjAKkwdrImx.oO" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-ExtractGrantsGovDBToXML"
      ~ last_modified                  = "2023-11-13T01:45:07.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ExtractGrantsGovDBToXML:37" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ExtractGrantsGovDBToXML:37/invocations" -> (known after apply)
      ~ s3_key                         = "22727beabcc276c85ec71cfb71993bb6.zip" -> "af95b7d97693f06819e40ab1fae30546.zip"
        tags                           = {}
      ~ version                        = "37" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:f9825667bd5af760860985b869dafe5ba952b6b7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml" -> "git.commit.sha:576550af912f284bf7de34646e61f57d11b1f5fd,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml"
              ~ "DD_VERSION"                   = "f9825667bd5af760860985b869dafe5ba952b6b7" -> "576550af912f284bf7de34646e61f57d11b1f5fd"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "37" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "edcd46f9b654e0402f1256665e76002a-3" -> (known after apply)
      ~ id                     = "8a12effd1536f9b8848de6ba383d329b.zip" -> (known after apply)
      ~ key                    = "8a12effd1536f9b8848de6ba383d329b.zip" -> "fdd17a7bf6f957a92e9fa6294ad73ba0.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "67s1OXQkR_VmedcjOzb0A2OXOxO7TeTJ" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PersistFFISData"
      ~ last_modified                  = "2023-11-13T01:45:07.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistFFISData:37" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistFFISData:37/invocations" -> (known after apply)
      ~ s3_key                         = "8a12effd1536f9b8848de6ba383d329b.zip" -> "fdd17a7bf6f957a92e9fa6294ad73ba0.zip"
        tags                           = {}
      ~ version                        = "37" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:f9825667bd5af760860985b869dafe5ba952b6b7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata" -> "git.commit.sha:576550af912f284bf7de34646e61f57d11b1f5fd,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata"
              ~ "DD_VERSION"                    = "f9825667bd5af760860985b869dafe5ba952b6b7" -> "576550af912f284bf7de34646e61f57d11b1f5fd"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "37" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "eea5ca3f48e50316b4328af268c1968c-3" -> (known after apply)
      ~ id                     = "fc7557e40c69ab333d608214acf87716.zip" -> (known after apply)
      ~ key                    = "fc7557e40c69ab333d608214acf87716.zip" -> "14ff5dbc8cee713869c271a8d93ce358.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "7d9ZzQpcAUWqEnK.DpKyXMUQS6G5ezTV" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PersistGrantsGovXMLDB"
      ~ last_modified                  = "2023-11-13T01:45:10.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistGrantsGovXMLDB:37" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistGrantsGovXMLDB:37/invocations" -> (known after apply)
      ~ s3_key                         = "fc7557e40c69ab333d608214acf87716.zip" -> "14ff5dbc8cee713869c271a8d93ce358.zip"
        tags                           = {}
      ~ version                        = "37" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:f9825667bd5af760860985b869dafe5ba952b6b7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb" -> "git.commit.sha:576550af912f284bf7de34646e61f57d11b1f5fd,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb"
              ~ "DD_VERSION"                    = "f9825667bd5af760860985b869dafe5ba952b6b7" -> "576550af912f284bf7de34646e61f57d11b1f5fd"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "37" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "e073c5f25492b525019f8d5e7b95e5eb-3" -> (known after apply)
      ~ id                     = "c34668e756f10a9bddf8bf4f1ba70473.zip" -> (known after apply)
      ~ key                    = "c34668e756f10a9bddf8bf4f1ba70473.zip" -> "77d703adedc72840a152c7a72d25ec17.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "yezk0Qu8aQXQF1fNz6.BX.AgrkofB294" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PublishGrantEvents"
      ~ last_modified                  = "2023-11-13T01:45:10.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PublishGrantEvents:38" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PublishGrantEvents:38/invocations" -> (known after apply)
      ~ s3_key                         = "c34668e756f10a9bddf8bf4f1ba70473.zip" -> "77d703adedc72840a152c7a72d25ec17.zip"
        tags                           = {}
      ~ version                        = "38" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:f9825667bd5af760860985b869dafe5ba952b6b7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:publishgrantevents" -> "git.commit.sha:576550af912f284bf7de34646e61f57d11b1f5fd,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:publishgrantevents"
              ~ "DD_VERSION"                   = "f9825667bd5af760860985b869dafe5ba952b6b7" -> "576550af912f284bf7de34646e61f57d11b1f5fd"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_permission.current_version_triggers["dynamodb"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "dynamodb" -> (known after apply)
      ~ qualifier           = "38" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "d199075c04ba8c89b88ea4aa08ac43ed-3" -> (known after apply)
      ~ id                     = "115011292f90ca1f0d172dc49373cce7.zip" -> (known after apply)
      ~ key                    = "115011292f90ca1f0d172dc49373cce7.zip" -> "35596e98ae7c6f8271ee8c7e84da51f9.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = ".Y3PxjjJwJsv664hLYRSSx85qhCAmj.R" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-ReceiveFFISEmail"
      ~ last_modified                  = "2023-11-13T01:45:07.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ReceiveFFISEmail:36" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ReceiveFFISEmail:36/invocations" -> (known after apply)
      ~ s3_key                         = "115011292f90ca1f0d172dc49373cce7.zip" -> "35596e98ae7c6f8271ee8c7e84da51f9.zip"
        tags                           = {}
      ~ version                        = "36" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:f9825667bd5af760860985b869dafe5ba952b6b7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:receiveffisemail" -> "git.commit.sha:576550af912f284bf7de34646e61f57d11b1f5fd,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:receiveffisemail"
              ~ "DD_VERSION"                     = "f9825667bd5af760860985b869dafe5ba952b6b7" -> "576550af912f284bf7de34646e61f57d11b1f5fd"
                # (12 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "36" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "6df8dca45490906e0f3c95682e1eedc4-3" -> (known after apply)
      ~ id                     = "3e9ba9ea945b22cf7978baef9b6a0315.zip" -> (known after apply)
      ~ key                    = "3e9ba9ea945b22cf7978baef9b6a0315.zip" -> "d0636b3ff1b164fb9a6f687aa6ce44b9.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "B.uXy6MTw4aBceH0oLHE6aa7xykwRVEf" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-SplitFFISSpreadsheet"
      ~ last_modified                  = "2023-11-13T01:45:11.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitFFISSpreadsheet:37" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitFFISSpreadsheet:37/invocations" -> (known after apply)
      ~ s3_key                         = "3e9ba9ea945b22cf7978baef9b6a0315.zip" -> "d0636b3ff1b164fb9a6f687aa6ce44b9.zip"
        tags                           = {}
      ~ version                        = "37" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:f9825667bd5af760860985b869dafe5ba952b6b7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet" -> "git.commit.sha:576550af912f284bf7de34646e61f57d11b1f5fd,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet"
              ~ "DD_VERSION"                       = "f9825667bd5af760860985b869dafe5ba952b6b7" -> "576550af912f284bf7de34646e61f57d11b1f5fd"
                # (14 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "37" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "485edea0e1fcaf312d398e2ee0aa0a3d-3" -> (known after apply)
      ~ id                     = "32dd20f3998f7d4fbcd9acd85cb121d6.zip" -> (known after apply)
      ~ key                    = "32dd20f3998f7d4fbcd9acd85cb121d6.zip" -> "c8887d7a7affdab43af96c3003db6df3.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "j2qPpiz8JOQAIB7QHQKv8QyVYAXsTmdV" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-11-13T01:45:07.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitGrantsGovXMLDB:37" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitGrantsGovXMLDB:37/invocations" -> (known after apply)
      ~ s3_key                         = "32dd20f3998f7d4fbcd9acd85cb121d6.zip" -> "c8887d7a7affdab43af96c3003db6df3.zip"
        tags                           = {}
      ~ version                        = "37" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:f9825667bd5af760860985b869dafe5ba952b6b7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:576550af912f284bf7de34646e61f57d11b1f5fd,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "f9825667bd5af760860985b869dafe5ba952b6b7" -> "576550af912f284bf7de34646e61f57d11b1f5fd"
                # (14 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "37" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 20 to add, 11 to change, 20 to destroy.
```

</details>

*Pusher: @dependabot[bot], Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/6858565541)*